comand_start = '''Добро пожаловать в бота Weather Insights! 🌤️

Этот бот поможет вам легко визуализировать данные о погоде! 📊

Всего в несколько шагов вы можете получить:

- Графики среднемесячной температуры, давления и осадков
- Тренды среднесуточных значений температуры, давления и осадков

🌍 Просто укажите ваше местоположение и период времени — остальное сделаем мы!

Давайте изучать погоду вместе. Начните с команды /help или отправьте первый запрос. 🚀'''

comand_help = '''Как использовать бота Weather Insights 🌟

Добро пожаловать! Вот как вы можете взаимодействовать с ботом:

Основные команды:

/start — Запустить бота и получить краткое введение.
/help — Показать это справочное сообщение с инструкциями.

Команды для построения графиков:

/Temperature_plot — Построить график среднесуточных или среднемесячных температур.
/Precipitation_plot — Создать график трендов осадков.
/Surface_pressure_plot — Визуализировать изменения атмосферного давления.

Правила ввода:

Названия городов: Вводите на английском языке (например, "Moscow", "Saratov").
Формат даты: Используйте формат YYYY-MM-DD (например, "1994-04-14").

⚠️ Убедитесь в правильности ввода данных, чтобы получить максимально точные результаты и графики!

Удачи и приятного исследования погодных трендов! 🌈'''
